CRUD Operations:


C--> Create
R--->Read/Retrieval
U--->Update
D--->Delete

**UPDATE Commands**


/** Update lastName of EmpId =6 to "Tanwar"
UPDATE employee SET LastName ="Tanwar" WHERE
EmpID=6;


Output:

EmpID, FirstName, LastName, Age, Salary, Location

Priya	Bhatia	26	100000	Bengaluru
Sumedha	Midha	32	50000	Gurugram
Rashmi	Tanwar	30	20000	Bengaluru
Shivam	Mishra	28	10000	Noida
Ajay	Bhatia	25	5000	Mumbai
Ankit	Tanwar	34	70000	Bengaluru
Alia	Bhatt	29	50000	Gurugram



/** Update Salary  of EmpId =5 from 5000 to 50000
UPDATE employee SET Salary=50000 WHERE EmpID=5;


Output:

EmpID, FirstName, LastName, Age, Salary, Location

'1', 'Priya', 'Bhatia', '26', '100000', 'Bengaluru'
'2', 'Sumedha', 'Midha', '32', '50000', 'Gurugram'
'3', 'Rashmi', 'Tanwar', '30', '20000', 'Bengaluru'
'4', 'Shivam', 'Mishra', '28', '10000', 'Noida'
'5', 'Ajay', 'Bhatia', '25', '50000', 'Mumbai'

**DELETE COMMANDS**


Example:

From the table employee delete a record whose EmpId=6

DELETE from employee WHERE EmpID=6

Output:

EmpID, FirstName, LastName, Age, Salary, Location

'1', 'Priya', 'Bhatia', '26', '100000', 'Bengaluru'
'2', 'Sumedha', 'Midha', '32', '50000', 'Gurugram'
'3', 'Rashmi', 'Tanwar', '30', '20000', 'Bengaluru'
'4', 'Shivam', 'Mishra', '28', '10000', 'Noida'
'5', 'Ajay', 'Bhatia', '25', '50000', 'Mumbai'
'7', 'Alia', 'Bhatt', '29', '50000', 'Gurugram'

**There are two types of Queries in SQL**

1. DDL==> Data Definition Language

   Example Data Definition Language Commands :

                                            1. Creation command

                                            2. Read Command

                                            3. Drop command

                                            4. Alter command


2. DML==> Data Manupulation language

   Example Data Manupulation Language Commands :

                                              1. Update command

                                              2. Deletion command

                                              3. Insert command

**What is the difference between the UPDATE command and the ALTER command?**

A:**ALTER** - This command is used to change the **SCHEMA** of the table

**ALTER** has three types of subcommands that are used along with **ALTER**

i. **ADD** -Add a New Column

Example -

**To add an Additional column in the table employee we use ALTER  command with ADD**

Example-

ALTER TABLE employee ADD Job_Desc varchar(20) ;

ii. **MODIFY**-Modification of the already available column

Example-

Modifying the schema of the employee table . change the length of the column FirstName from varchar(50 ) to varchar(20)

ALTER TABLE employee **MODIFY** FirstName varchar(20) ;

iii. **DROP**-Delete any specific column

Example:

**To delete an existing column in the table employee we use ALTER  command with DROP**

Example:

ALTER TABLE employee DROP Salary int;

  **UPDATE** -This command is used to change the data of any available records in the table.

  Example:

  Update employee set FirstName =" Tiwari" WHERE EmpID=4

**Aggregation Commands** -All the actions are taken on the table in a Database.

1. COUNT()
2. MAX()
3. MIN()
4. SUM()
5. GROUP BY()

Example:

1. **Count command** - Count the number of employees working in a company in the employee table

Example:

SELECT COUNT(*) FROM employee; --This command counts the number of employees in the table.

**Provide the alias name to the column COUNT(*)**

Example:

SELECT COUNT(*) As Total_Num_Employee FROM employee;

Output:

Total_Num_Employee
8



2. **Max command** - Provides  Maximum value for a particular column in the employee table

Example:

SELECT MAX(Salary) FROM employee; --This command returns the Max Salary of employees in the table.

**Provide the alias name to the column Max(Salary) As Max_Salary**

Example:

SELECT MAX(Salary) As Max_Salary FROM employee;

Output:

Max_Salary
'100000'


3. **Min command** - Provides  Minimum value for a particular column in the employee table

Example:

SELECT MIN(Salary) FROM employee; --This command returns the Min Salary of employees in the table.

**Provide the alias name to the column Min(Salary) As Max_Salary**

Example:

SELECT MIN(Salary) As Min_Salary FROM employee;

Output:
Min_Salary
'10000'

4. **Sum command** - Provides  total aggregated value for a particular column in the employee table

Example:

SELECT SUM(Salary) FROM employee; --This command returns the total  SUM  Salary of all the employees in the table.

**Provide the alias name to the column Sum(Salary) As Total_Cost_Company**

Example:

SELECT SUM(Salary) As Total_Cost_Company FROM employee;